ERP.belugaerp/src/Catalogs/бг_creatio_НастройкиОбмена/бг_creatio_НастройкиОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_creatio_НастройкиОбмена</name>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборВидыЦен</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗаказы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборСклады</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоварныеКатегорииНМК</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоварныеКатегорииСКЮ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЗаполненияДоговоров</name>
    <attributes>
      <name>ВариантОплаты</name>
      <type>
        <types>EnumRef.бг_ВариантыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОплатыУдалить</name>
      <type>
        <types>EnumRef.ФормыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоАлкогольнаяПродажа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗаполненияЛицензий</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеЗаполненияПунктовНазначения</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИдентификаторыТиповДанныхУПП</name>
    <attributes>
      <name>СтроковоеПредставлениеТипаУПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>CatalogRef.ЛицензииПоставщиковАлкогольнойПродукции</types>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.битПунктыНазначения</types>
        <types>EnumRef.ФормыОплаты</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.ВидыЦен</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыТМ</types>
        <types>CatalogRef.бг_ЕК_Бренды_БрендыМТ</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.СегментыПартнеров</types>
        <types>CatalogRef.бг_ЕК_СКЮ_Классы</types>
        <types>CatalogRef.ТоварныеКатегории</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Enums/бг_creatio_ТипыОбъектовОбмена/бг_creatio_ТипыОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_creatio_ТипыОбъектовОбмена</name>
  <enumValues>
    <name>ВидыЦен</name>
  </enumValues>
  <enumValues>
    <name>Заказы</name>
  </enumValues>
  <enumValues>
    <name>Клиенты</name>
  </enumValues>
  <enumValues>
    <name>Склады</name>
  </enumValues>
  <enumValues>
    <name>ТоварыСКЮ</name>
  </enumValues>
  <enumValues>
    <name>ТоварыНМК</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/бг_creatio_НастройкиОбмена/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

//Возвращает структуру с данными для заполнения запроса
// Тип возвращаемого значения - Структура
//
//Параметры:
// ТипДанных - Строка (тип метаданных объекта)
//
Функция ДанныеДляПостроенияЗапроса(ТипДанных) Экспорт
	
	ДанныеЗапроса = Новый Структура("ТекстЗапроса, Параметры");
	
	Настройка = ДействующаяНастройкаОбмена();
	Если Настройка = Неопределено Тогда
		Возврат ДанныеЗапроса;
	КонецЕсли;
	
	ДанныеКомпоновки = ДанныеКомпоновки(ТипДанных, Настройка);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(
			ДанныеКомпоновки.СхемаКомпоновкиДанных));
	
	Если ЗначениеЗаполнено(ДанныеКомпоновки.НастройкиОтбора) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ДанныеКомпоновки.НастройкиОтбора);
	КонецЕсли;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(
								ДанныеКомпоновки.СхемаКомпоновкиДанных, 
								КомпоновщикНастроек.Настройки);
	
	ДанныеЗапроса.ТекстЗапроса = МакетКомпоновкиДанных.НаборыДанных[0].Запрос;
	Если МакетКомпоновкиДанных.ЗначенияПараметров.Количество() > 0 Тогда
		ПараметрыЗапроса = Новый Структура;
		Для Каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
			ПараметрыЗапроса.Вставить(Параметр.Имя, Параметр.Значение);
		КонецЦикла;
		ДанныеЗапроса.Вставить("Параметры", ПараметрыЗапроса);
	КонецЕсли;
	
	Возврат ДанныеЗапроса;
	
КонецФункции

// Возвращает настройку обмена
// 
//  Тип возвращаемого значения - СправочникСсылка.бг_creatio_НастройкиОбмена
//
Функция ДействующаяНастройкаОбмена() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бг_creatio_НастройкиОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бг_creatio_НастройкиОбмена КАК бг_creatio_НастройкиОбмена
	|ГДЕ
	|	НЕ бг_creatio_НастройкиОбмена.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеКомпоновки(ТипДанных, Настройка)
	
	ДанныеКомпоновки = Новый Структура("СхемаКомпоновкиДанных, НастройкиОтбора");
	
	ПеречислениеМенеджер = Перечисления.бг_creatio_ТипыОбъектовОбмена;
	
	Если ТипДанных = ПеречислениеМенеджер.Заказы Тогда
		ДанныеКомпоновки.СхемаКомпоновкиДанных = Справочники.бг_creatio_НастройкиОбмена.ПолучитьМакет("ШаблонЗаказы");
		ДанныеКомпоновки.НастройкиОтбора = Настройка.ОтборЗаказы.Получить();
	ИначеЕсли ТипДанных = ПеречислениеМенеджер.ВидыЦен Тогда 
		ДанныеКомпоновки.СхемаКомпоновкиДанных = Справочники.бг_creatio_НастройкиОбмена.ПолучитьМакет("ШаблонВидыЦен");
		ДанныеКомпоновки.НастройкиОтбора = Настройка.ОтборВидыЦен.Получить();
	ИначеЕсли ТипДанных = ПеречислениеМенеджер.Склады Тогда 
		ДанныеКомпоновки.СхемаКомпоновкиДанных = Справочники.бг_creatio_НастройкиОбмена.ПолучитьМакет("ШаблонСклады");
		ДанныеКомпоновки.НастройкиОтбора = Настройка.ОтборСклады.Получить();
	ИначеЕсли ТипДанных = ПеречислениеМенеджер.ТоварыНМК Тогда 
		ДанныеКомпоновки.СхемаКомпоновкиДанных = Справочники.бг_creatio_НастройкиОбмена.ПолучитьМакет("ШаблонТоварныеКатегорииНМК");
		ДанныеКомпоновки.НастройкиОтбора = Настройка.ОтборТоварныеКатегорииНМК.Получить();
	ИначеЕсли ТипДанных = ПеречислениеМенеджер.ТоварыСКЮ Тогда 
		ДанныеКомпоновки.СхемаКомпоновкиДанных = Справочники.бг_creatio_НастройкиОбмена.ПолучитьМакет("ШаблонТоварныеКатегорииСКЮ");
		ДанныеКомпоновки.НастройкиОтбора = Настройка.ОтборТоварныеКатегорииСКЮ.Получить();
	КонецЕсли;
	
	Возврат ДанныеКомпоновки;
	
КонецФункции

#КонецОбласти
